grevaillot/svd_tools/headers/STM32H7x7_CM7/gpiob.h
#pragma once 

/* --- GPIOB: GPIO -------------------------------------------------- */

/** @defgroup gpiob_registers GPIO Register
@{*/

/** GPIOB_GPIO_MODER GPIO port mode register **/
#define GPIOB_GPIO_MODER			MMIO32(GPIOB_BASE + 0x00)
/** GPIOB_GPIO_OTYPER GPIO port output type register **/
#define GPIOB_GPIO_OTYPER			MMIO32(GPIOB_BASE + 0x04)
/** GPIOB_GPIO_OSPEEDR GPIO port output speed register **/
#define GPIOB_GPIO_OSPEEDR			MMIO32(GPIOB_BASE + 0x08)
/** GPIOB_GPIO_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOB_GPIO_PUPDR			MMIO32(GPIOB_BASE + 0x0c)
/** GPIOB_GPIO_IDR GPIO port input data register **/
#define GPIOB_GPIO_IDR			MMIO32(GPIOB_BASE + 0x10)
/** GPIOB_GPIO_ODR GPIO port output data register **/
#define GPIOB_GPIO_ODR			MMIO32(GPIOB_BASE + 0x14)
/** GPIOB_GPIO_BSRR GPIO port bit set/reset register **/
#define GPIOB_GPIO_BSRR			MMIO32(GPIOB_BASE + 0x18)
/** GPIOB_GPIO_LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers). **/
#define GPIOB_GPIO_LCKR			MMIO32(GPIOB_BASE + 0x1c)
/** GPIOB_GPIO_AFRL GPIO alternate function low register **/
#define GPIOB_GPIO_AFRL			MMIO32(GPIOB_BASE + 0x20)
/** GPIOB_GPIO_AFRH GPIO alternate function high register **/
#define GPIOB_GPIO_AFRH			MMIO32(GPIOB_BASE + 0x24)

/**@}*/


/** @defgroup gpiob_gpio_moder GPIOMODER GPIO port mode register
@{*/


#define GPIOB_GPIO_MODER_MODER15_SHIFT		30
#define GPIOB_GPIO_MODER_MODER15_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder15 MODER15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER14_SHIFT		28
#define GPIOB_GPIO_MODER_MODER14_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder14 MODER14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER13_SHIFT		26
#define GPIOB_GPIO_MODER_MODER13_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder13 MODER13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER12_SHIFT		24
#define GPIOB_GPIO_MODER_MODER12_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder12 MODER12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER11_SHIFT		22
#define GPIOB_GPIO_MODER_MODER11_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder11 MODER11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER10_SHIFT		20
#define GPIOB_GPIO_MODER_MODER10_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder10 MODER10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER9_SHIFT		18
#define GPIOB_GPIO_MODER_MODER9_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder9 MODER9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER8_SHIFT		16
#define GPIOB_GPIO_MODER_MODER8_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder8 MODER8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER7_SHIFT		14
#define GPIOB_GPIO_MODER_MODER7_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder7 MODER7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER6_SHIFT		12
#define GPIOB_GPIO_MODER_MODER6_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder6 MODER6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER5_SHIFT		10
#define GPIOB_GPIO_MODER_MODER5_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder5 MODER5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER4_SHIFT		8
#define GPIOB_GPIO_MODER_MODER4_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder4 MODER4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER3_SHIFT		6
#define GPIOB_GPIO_MODER_MODER3_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder3 MODER3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER2_SHIFT		4
#define GPIOB_GPIO_MODER_MODER2_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder2 MODER2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER1_SHIFT		2
#define GPIOB_GPIO_MODER_MODER1_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder1 MODER1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOB_GPIO_MODER_MODER0_SHIFT		0
#define GPIOB_GPIO_MODER_MODER0_MASK		0x03
/** @defgroup gpiob_gpio_moder_moder0 MODER0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiob_gpio_otyper GPIOOTYPER GPIO port output type register
@{*/

/** GPIOB_GPIO_OTYPER_OT15 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT15		(1 << 15)
/** GPIOB_GPIO_OTYPER_OT14 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT14		(1 << 14)
/** GPIOB_GPIO_OTYPER_OT13 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT13		(1 << 13)
/** GPIOB_GPIO_OTYPER_OT12 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT12		(1 << 12)
/** GPIOB_GPIO_OTYPER_OT11 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT11		(1 << 11)
/** GPIOB_GPIO_OTYPER_OT10 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT10		(1 << 10)
/** GPIOB_GPIO_OTYPER_OT9 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT9		(1 << 9)
/** GPIOB_GPIO_OTYPER_OT8 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT8		(1 << 8)
/** GPIOB_GPIO_OTYPER_OT7 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT7		(1 << 7)
/** GPIOB_GPIO_OTYPER_OT6 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT6		(1 << 6)
/** GPIOB_GPIO_OTYPER_OT5 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT5		(1 << 5)
/** GPIOB_GPIO_OTYPER_OT4 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT4		(1 << 4)
/** GPIOB_GPIO_OTYPER_OT3 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT3		(1 << 3)
/** GPIOB_GPIO_OTYPER_OT2 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT2		(1 << 2)
/** GPIOB_GPIO_OTYPER_OT1 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT1		(1 << 1)
/** GPIOB_GPIO_OTYPER_OT0 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOB_GPIO_OTYPER_OT0		(1 << 0)

/**@}*/

